#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan on staging env 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/so-gineers/workbook/runs/run-L63bQpCDURTVxLc7

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_app.workbook will be created
  + resource "heroku_app" "workbook" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "workbook_staging"
      + region                = "us"
      + sensitive_config_vars = (sensitive value)
      + stack                 = "container"
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_domain.workbook will be created
  + resource "heroku_domain" "workbook" {
      + app             = "workbook_staging"
      + cname           = (known after apply)
      + hostname        = "api-staging-workbook.so-gineers.com"
      + id              = (known after apply)
      + sni_endpoint_id = (known after apply)
    }

  # heroku_formation.workbook will be created
  + resource "heroku_formation" "workbook" {
      + app      = "workbook_staging"
      + id       = (known after apply)
      + quantity = 1
      + size     = "Standard-1X"
      + type     = "web"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + heroku_web_hostname = (known after apply)
  + heroku_web_url      = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "application_tarball_url"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "application_version" but
│ a value was found in file "/terraform/terraform.tfvars". If you meant to
│ use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Author: @papapathe,
*Action: `pull_request`,
*Working Directory: ``,
*Workflow: `.github/workflows/terraform-heroku.yml`*